backend/jmeter/question/jmeter.log
2020-05-07 22:14:50,514 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-05-07 22:14:50,532 INFO o.a.j.JMeter: Loading user properties from: /home/tiagoantunes/Documents/.libs/jmeter/bin/user.properties
2020-05-07 22:14:50,532 INFO o.a.j.JMeter: Loading system properties from: /home/tiagoantunes/Documents/.libs/jmeter/bin/system.properties
2020-05-07 22:14:50,533 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: Version 5.2.1
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: java.version=11.0.6
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: os.name=Linux
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: os.arch=amd64
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: os.version=4.15.0-30deepin-generic
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: file.encoding=UTF-8
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: java.awt.headless=true
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: Max memory     =1073741824
2020-05-07 22:14:50,534 INFO o.a.j.JMeter: Available Processors =8
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: JMeterHome=/home/tiagoantunes/Documents/.libs/jmeter
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: user.dir  =/home/tiagoantunes/Documents/IST/3ano/ES/proj/backend/jmeter/question
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: PWD       =/home/tiagoantunes/Documents/IST/3ano/ES/proj/backend/jmeter/question
2020-05-07 22:14:50,543 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: wukong FullName: tiagoantunes
2020-05-07 22:14:50,557 INFO o.a.j.s.FileServer: Default base='/home/tiagoantunes/Documents/IST/3ano/ES/proj/backend/jmeter/question'
2020-05-07 22:14:50,560 INFO o.a.j.s.FileServer: Set new base='/home/tiagoantunes/Documents/IST/3ano/ES/proj/backend/jmeter/question'
2020-05-07 22:14:50,681 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-05-07 22:14:50,696 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-05-07 22:14:50,700 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-05-07 22:14:50,704 INFO o.a.j.s.SaveService: Loading file: WSStudentResubmitQuestion.jmx
2020-05-07 22:14:50,772 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-05-07 22:14:50,772 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-05-07 22:14:50,773 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-05-07 22:14:50,773 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-05-07 22:14:50,773 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-05-07 22:14:50,773 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-05-07 22:14:50,833 INFO o.a.j.JMeter: Creating summariser <summary>
2020-05-07 22:14:50,838 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-05-07 22:14:50,841 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-05-07 22:14:50,841 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-05-07 22:14:50,847 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-05-07 22:14:50,847 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-05-07 22:14:51,139 ERROR o.a.j.p.j.c.DataSourceElement: JDBC data source already defined for: test_student_question
2020-05-07 22:14:51,140 INFO o.a.j.JMeter: Running test (1588886091139)
2020-05-07 22:14:51,141 INFO o.a.j.e.StandardJMeterEngine: Starting setUp thread groups
2020-05-07 22:14:51,141 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 1 : setUp Thread Group 
2020-05-07 22:14:51,141 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group setUp Thread Group.
2020-05-07 22:14:51,141 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-05-07 22:14:51,141 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-05-07 22:14:51,144 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-05-07 22:14:51,144 INFO o.a.j.e.StandardJMeterEngine: Waiting for all setup thread groups to exit
2020-05-07 22:14:51,146 INFO o.a.j.t.JMeterThread: Thread started: setUp Thread Group 1-1
2020-05-07 22:14:51,149 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-05-07 22:14:51,149 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-05-07 22:14:51,149 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-05-07 22:14:51,149 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-05-07 22:14:51,248 INFO o.a.j.t.JMeterThread: Thread is done: setUp Thread Group 1-1
2020-05-07 22:14:51,248 INFO o.a.j.t.JMeterThread: Thread finished: setUp Thread Group 1-1
2020-05-07 22:14:51,248 INFO o.a.j.e.StandardJMeterEngine: All Setup Threads have ended
2020-05-07 22:14:51,263 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users Thread Group
2020-05-07 22:14:51,263 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Users Thread Group.
2020-05-07 22:14:51,264 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-05-07 22:14:51,264 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-05-07 22:14:51,267 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-05-07 22:14:51,267 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-05-07 22:14:51,268 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-1
2020-05-07 22:14:51,286 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = wukong
2020-05-07 22:14:51,292 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-05-07 22:14:53,860 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-1
2020-05-07 22:14:53,860 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-1
2020-05-07 22:14:53,861 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown thread groups
2020-05-07 22:14:53,861 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown ThreadGroup: 1 : tearDown Thread Group
2020-05-07 22:14:53,861 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group tearDown Thread Group.
2020-05-07 22:14:53,861 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-05-07 22:14:53,861 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-05-07 22:14:53,862 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-05-07 22:14:53,862 INFO o.a.j.t.JMeterThread: Thread started: tearDown Thread Group 1-1
2020-05-07 22:14:53,877 INFO o.a.j.t.JMeterThread: Thread is done: tearDown Thread Group 1-1
2020-05-07 22:14:53,877 INFO o.a.j.t.JMeterThread: Thread finished: tearDown Thread Group 1-1
2020-05-07 22:14:53,878 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-05-07 22:14:53,881 INFO o.a.j.r.Summariser: summary =      7 in 00:00:03 =    2.6/s Avg:   360 Min:     1 Max:  2166 Err:     0 (0.00%)